import { useNavigate  } from 'react-router-dom';
import '../App.css';


const Main = () => {
    const navigate = useNavigate();

  return (
    
<div id="container">
  <div id="header">
  <a onClick={() => navigate("/LoginModel")} id="about">התחבר</a>
    <a href="#first_about" id="donations">תרומות</a>
  </div>

  <div id="div_about">
    <div id="first_about">
      <img id="dolar" src="/img/dolar.png" alt="$" />
      <h1 id="donations_h1">השתתפות בקודש</h1>
      <h4 id="donations_h4">היו שותפים בהנחלת דרכו של רבי נחמן – חינוך אמיתי עם שמחה, אמונה ותפילה לדור הבא</h4>
      <a href="#donations_h3">
        <p id="btn_donations">לתרומות</p>
      </a>
    </div>

    <h3 id="about_h3">עלינו ועל דרכנו</h3>

    <p id="about_p">
      <br />
      <strong>דרכם של מוסדות ברסלב: מסע רוחני ומחויבות לעתיד</strong><br /><br />
      <strong>רקע והקמה</strong><br /><br />
      מוסדות ברסלב הוקמו ביוזמתו של ר' שמעון ברגשטיין, איש רוח ומרצה משפיע אשר הקדיש את מרצו ומרצו להנחלת ערכי חסידות ברסלב.<br />
      ר' שמעון ברגשטיין, אישיות שנודעה בכנותה ובמסירותה, חתר להקים מסגרת חינוכית ורוחנית שתשמור על רוח התורה ותחנך דור חדש לפי עקרונות חסידות ברסלב.<br />
      הוא האמין שהדרך הייחודית של ברסלב, אשר שואבת השראה מהוראותיו של רבי נחמן מברסלב, יכולה לשמש מקור אור ורוח לנוער ולמבוגרים כאחד.<br />
      המוסדות שייסד היוו מקום בו ניתן ללמוד ולהתרשם מהתורה בצורה שמחברת בין השכל ללב, ובין המסורת לחידוש.<br /><br />
      <strong>העבר וההווה</strong><br /><br />
      כיום, בראשות המוסדות עומד בנו של ר' שמעון, ר' נחמן אליעזר ברגשטיין, אשר ממשיך את דרכו ומוביל את המוסדות בעוז ובנחישות.
      ר' נחמן אליעזר ברגשטיין, אשר צמח מהשקפת עולמו של אביו, הביא עימו גישה רעננה ומודרנית המשלבת את ההשקפות המסורתיות עם הצרכים והאתגרים של הדור הנוכחי.
      בעשייה הנמרצת שלו, ר' נחמן אליעזר יצר חידושים ומיזמים המרחיבים את גבולות ההשפעה של המוסדות.
      הוא מקפיד לשמר את המסר הרוחני והחינוכי של חסידות ברסלב, תוך התאמת התכנים והפעילויות לצרכים המודרניים.<br /><br />
      <strong>הערכים והחזון</strong><br /><br />
      המוסדות שואפים להנחיל את עקרונות חסידות ברסלב תוך שמירה על איכות החינוך והנחלת הרוחניות.
      הערכים המרכזיים של המוסדות כוללים את האמונה בכוחו של כל אדם להשפיע על חייו ועל סביבתו,
      את החשיבות שבקיום חיים רוחניים עשירים ועמוקים, ואת ההשקעה בפרטים הקטנים וביחס אישי לכל תלמיד ותלמידה.
      החזון של המוסדות הוא להוות מקום של השראה, צמיחה ורוחניות, ולספק לתלמידים את הכלים להתמודד עם אתגרי החיים תוך שמירה על קשר עמוק עם המסורת והאמונה.<br /><br />
      <strong>התפתחות ועתיד</strong><br /><br />
      ההצלחה של מוסדות ברסלב נובעת מהיכולת לשלב בין המסורת לחידוש, בין העבר להווה.
      עם השנים, המוסדות התפתחו והתרחבו, תוך שמירה על האיכות והעקרונות שהנחו את ר' שמעון ברגשטיין.
      תחת הנהגתו של ר' נחמן אליעזר ברגשטיין, המוסדות ממשיכים לצמוח ולהתרחב,
      כשהם שואפים להביא את אור התורה והחסידות ליותר ויותר אנשים.
      המוסדות רואים את עצמם כשותפים למסע הרוחני של כל תלמיד , וממשיכים לעצב את עתידם על פי הערכים והעקרונות של חסידות ברסלב,
      תוך מענה לצרכים המשתנים של הדור הנוכחי.
    </p>

    <br /><br /><br />

    <div id="type_donations">
      <div id="roll_dinami"></div>
      <h3 id="donations_h3">השתתפות בקודש</h3>

      <div id="roll">
        <div id="roll_1">
          <h3>נר למאור</h3>
          <img id="candle" src="/img/candle.png" alt="נר למאור" />
        </div>
        <div id="roll_2">
          <h3>יציאות לשדה</h3>
          <img id="feild" src="/img/עץ.png" alt="יציאה לשדה" />
        </div>
        <div id="roll_4">
          <h3>שבת בישיבה</h3>
          <img onClick={()=>navigate("./ShabatTruma")} id="shabes" src="/img/שבת.png" alt="שבת בישיבה" />
        </div>
      </div>
    </div>

    <div id="miri">
      <p>Miri Bar Lev ©</p>
    </div>

    <p id="p_disap">
      "אור השבת המוענק דרך תמיכתך משמר את הדרך של רבינו ומביא שמירה וברכה לכל העוסקים בהפצת אורו"
    </p>
  </div>



  {/* <div id="roll_dinami" style={{ visibility: 'hidden' }}></div> */}
</div>

  );
}

export default Main;
